{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "6a3a323c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.2.6\n"
     ]
    }
   ],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "\n",
    "# Use Neo4j URI and credentials according to your setup\n",
    "# NEO4J_URI could look similar to \"bolt://my-server.neo4j.io:7687\"\n",
    "gds = GraphDataScience(\"bolt://localhost\", auth=(\"neo4j\",\"neo4j\"))\n",
    "\n",
    "\n",
    "# Check the installed GDS version on the server\n",
    "print(gds.version())\n",
    "assert gds.version()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "8914aa06",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(Graph({'graphName': 'disease-graph-2', 'nodeCount': 4176, 'relationshipCount': 5960, 'database': 'neo4j', 'configuration': {'relationshipQuery': 'MATCH (n)--(m) RETURN id(n) AS source, id(m) AS target', 'jobId': 'ff0c4827-1908-4993-80d8-afacf186ef07', 'creationTime': neo4j.time.DateTime(2023, 1, 2, 17, 10, 50, 828536253, tzinfo=<StaticTzInfo 'Etc/UTC'>), 'validateRelationships': True, 'nodeQuery': 'MATCH (n) RETURN id(n) AS id', 'sudo': True, 'readConcurrency': 4, 'parameters': []}, 'schema': {'graphProperties': {}, 'relationships': {'__ALL__': {}}, 'nodes': {'__ALL__': {}}}, 'memoryUsage': '1428 KiB'}),\n",
       " nodeQuery                                 MATCH (n) RETURN id(n) AS id\n",
       " relationshipQuery    MATCH (n)--(m) RETURN id(n) AS source, id(m) A...\n",
       " graphName                                              disease-graph-2\n",
       " nodeCount                                                         4176\n",
       " relationshipCount                                                 5960\n",
       " projectMillis                                                       16\n",
       " Name: 0, dtype: object)"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.graph.project.cypher(\n",
    "    'disease-graph-2',\n",
    "    'MATCH (n) RETURN id(n) AS id',\n",
    "    'MATCH (n)--(m) RETURN id(n) AS source, id(m) AS target')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "1a355443",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "49dffbeefcae44a6a5accfca2d77b65b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Louvain:   0%|          | 0/100 [00:00<?, ?%/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "louvain_stats=gds.louvain.stats(gds.graph.get('disease-graph-2'))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "dba8f7a0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "2121"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "louvain_stats.communityCount"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "03688b22",
   "metadata": {},
   "outputs": [],
   "source": [
    "louvain_stream=gds.louvain.stream(gds.graph.get('disease-graph-2'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "ddad7cae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "pandas.core.frame.DataFrame"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(louvain_stream)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "deac2e57",
   "metadata": {},
   "outputs": [],
   "source": [
    "louvain_stream.to_csv('disease-graph.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "05aa154d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import duckdb "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "83495d61",
   "metadata": {},
   "outputs": [],
   "source": [
    "con = duckdb.connect(database='my-db.duckdb', read_only=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "374d7e30",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<duckdb.DuckDBPyConnection at 0x7fbb9bd435b0>"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "con.execute(\"CREATE TABLE ontime AS SELECT * FROM 'disease-graph.csv'\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "73d28c8d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<duckdb.DuckDBPyConnection at 0x7fbb9bd435b0>"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "con.execute(\"SELECT communityId,count(*) as counter FROM ontime group BY communityId order by counter desc\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "b1ba6baa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[(3421, 190), (2767, 189), (2615, 172), (3549, 160), (3402, 120), (3561, 116), (3518, 108), (3190, 90), (2848, 74), (3239, 73), (2690, 64), (2931, 46), (3941, 40), (3248, 34), (3333, 28), (3734, 23), (3793, 21), (4083, 20), (3905, 17), (3159, 17), (3852, 14), (3425, 14), (3183, 13), (2941, 12), (3691, 12), (3313, 11), (3832, 11), (2590, 10), (2753, 10), (3236, 10), (3543, 9), (3870, 8), (2860, 8), (4076, 8), (3285, 7), (2862, 7), (3428, 7), (3737, 7), (2900, 6), (3932, 6), (2579, 6), (3087, 6), (3231, 6), (4128, 6), (4065, 6), (4171, 6), (2617, 5), (3864, 5), (3879, 5), (4060, 5), (2850, 5), (3959, 5), (3983, 5), (3210, 5), (4042, 5), (3551, 5), (3290, 5), (2511, 4), (2581, 4), (2686, 4), (3922, 4), (3945, 4), (4166, 4), (3101, 4), (3125, 4), (3974, 4), (3304, 4), (3567, 4), (3656, 4), (3660, 4), (3701, 4), (4148, 4), (3837, 3), (2582, 3), (2586, 3), (2600, 3), (2653, 3), (2783, 3), (2947, 3), (2955, 3), (3122, 3), (3978, 3), (3981, 3), (3162, 3), (3990, 3), (3263, 3), (4002, 3), (3325, 3), (4013, 3), (3423, 3), (3427, 3), (3461, 3), (4040, 3), (4053, 3), (4054, 3), (3556, 3), (3565, 3), (4101, 3), (3684, 3), (4132, 3), (4143, 3), (3272, 3), (3287, 3), (3437, 3), (3574, 3), (4038, 3), (4074, 3), (3400, 3), (3382, 3), (4134, 3), (2502, 2), (2514, 2), (2580, 2), (3843, 2), (2612, 2), (3848, 2), (2616, 2), (2689, 2), (3868, 2), (2775, 2), (3888, 2), (3894, 2), (3896, 2), (3897, 2), (3898, 2), (2830, 2), (3909, 2), (2843, 2), (2851, 2), (2852, 2), (3915, 2), (3921, 2), (2954, 2), (3934, 2), (3071, 2), (3960, 2), (3104, 2), (3113, 2), (3963, 2), (3128, 2), (3130, 2), (3970, 2), (3971, 2), (3973, 2), (3161, 2), (3176, 2), (3988, 2), (3992, 2), (3996, 2), (3997, 2), (4001, 2), (3307, 2), (3381, 2), (4008, 2), (4009, 2), (4010, 2), (4018, 2), (4019, 2), (4021, 2), (3459, 2), (4036, 2), (4037, 2), (3463, 2), (4046, 2), (3499, 2), (3500, 2), (3541, 2), (4059, 2), (3542, 2), (3558, 2), (3559, 2), (3562, 2), (4096, 2), (3570, 2), (3573, 2), (4099, 2), (3576, 2), (3618, 2), (3637, 2), (3638, 2), (4106, 2), (4107, 2), (3648, 2), (3655, 2), (4119, 2), (4124, 2), (4136, 2), (4139, 2), (3732, 2), (3733, 2), (3804, 2), (3805, 2), (4157, 2), (4146, 2), (3972, 2), (3989, 2), (3458, 2), (3501, 2), (4051, 2), (4063, 2), (3557, 2), (4068, 2), (4100, 2), (3622, 2), (4140, 2), (4067, 2), (4006, 2), (3460, 2), (4117, 2), (3592, 2), (3998, 2), (3362, 2), (3517, 2), (3693, 2), (4165, 2), (3831, 2), (3739, 2), (4155, 2), (0, 1), (1, 1), (3, 1), (4, 1), (5, 1), (6, 1), (8, 1), (10, 1), (11, 1), (12, 1), (13, 1), (14, 1), (15, 1), (17, 1), (18, 1), (19, 1), (20, 1), (21, 1), (22, 1), (24, 1), (25, 1), (26, 1), (27, 1), (28, 1), (31, 1), (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (39, 1), (41, 1), (42, 1), (43, 1), (46, 1), (47, 1), (49, 1), (50, 1), (51, 1), (52, 1), (54, 1), (55, 1), (56, 1), (57, 1), (58, 1), (59, 1), (60, 1), (61, 1), (63, 1), (65, 1), (66, 1), (67, 1), (68, 1), (69, 1), (70, 1), (72, 1), (73, 1), (74, 1), (75, 1), (76, 1), (77, 1), (79, 1), (81, 1), (82, 1), (83, 1), (84, 1), (85, 1), (86, 1), (88, 1), (90, 1), (91, 1), (93, 1), (94, 1), (95, 1), (96, 1), (98, 1), (99, 1), (100, 1), (102, 1), (103, 1), (104, 1), (106, 1), (107, 1), (108, 1), (109, 1), (110, 1), (111, 1), (112, 1), (113, 1), (114, 1), (116, 1), (118, 1), (119, 1), (120, 1), (121, 1), (122, 1), (123, 1), (125, 1), (126, 1), (128, 1), (129, 1), (130, 1), (131, 1), (133, 1), (137, 1), (138, 1), (140, 1), (141, 1), (142, 1), (143, 1), (145, 1), (146, 1), (147, 1), (148, 1), (149, 1), (150, 1), (151, 1), (153, 1), (156, 1), (158, 1), (160, 1), (161, 1), (162, 1), (163, 1), (165, 1), (166, 1), (169, 1), (170, 1), (171, 1), (173, 1), (174, 1), (175, 1), (176, 1), (177, 1), (179, 1), (180, 1), (181, 1), (182, 1), (183, 1), (184, 1), (185, 1), (186, 1), (187, 1), (189, 1), (190, 1), (191, 1), (195, 1), (197, 1), (198, 1), (199, 1), (200, 1), (201, 1), (202, 1), (204, 1), (205, 1), (206, 1), (207, 1), (208, 1), (212, 1), (213, 1), (214, 1), (215, 1), (216, 1), (218, 1), (219, 1), (220, 1), (221, 1), (222, 1), (223, 1), (224, 1), (225, 1), (226, 1), (227, 1), (229, 1), (231, 1), (233, 1), (234, 1), (235, 1), (236, 1), (238, 1), (240, 1), (241, 1), (242, 1), (243, 1), (244, 1), (245, 1), (246, 1), (247, 1), (249, 1), (250, 1), (251, 1), (252, 1), (253, 1), (254, 1), (256, 1), (257, 1), (258, 1), (259, 1), (260, 1), (261, 1), (262, 1), (264, 1), (265, 1), (267, 1), (268, 1), (269, 1), (270, 1), (271, 1), (273, 1), (274, 1), (276, 1), (277, 1), (278, 1), (279, 1), (280, 1), (281, 1), (285, 1), (286, 1), (287, 1), (288, 1), (289, 1), (290, 1), (291, 1), (292, 1), (293, 1), (294, 1), (295, 1), (296, 1), (297, 1), (298, 1), (299, 1), (300, 1), (301, 1), (303, 1), (305, 1), (308, 1), (310, 1), (312, 1), (313, 1), (316, 1), (317, 1), (318, 1), (319, 1), (320, 1), (321, 1), (322, 1), (324, 1), (325, 1), (326, 1), (328, 1), (329, 1), (330, 1), (331, 1), (332, 1), (333, 1), (334, 1), (336, 1), (337, 1), (341, 1), (342, 1), (343, 1), (344, 1), (345, 1), (346, 1), (347, 1), (348, 1), (349, 1), (350, 1), (352, 1), (353, 1), (354, 1), (356, 1), (357, 1), (358, 1), (359, 1), (360, 1), (361, 1), (362, 1), (364, 1), (366, 1), (368, 1), (369, 1), (370, 1), (371, 1), (373, 1), (374, 1), (375, 1), (376, 1), (377, 1), (378, 1), (380, 1), (384, 1), (388, 1), (390, 1), (391, 1), (392, 1), (393, 1), (394, 1), (395, 1), (396, 1), (398, 1), (400, 1), (407, 1), (408, 1), (409, 1), (410, 1), (411, 1), (412, 1), (413, 1), (414, 1), (415, 1), (416, 1), (419, 1), (421, 1), (423, 1), (424, 1), (425, 1), (426, 1), (427, 1), (429, 1), (430, 1), (431, 1), (432, 1), (435, 1), (436, 1), (440, 1), (444, 1), (445, 1), (446, 1), (447, 1), (449, 1), (451, 1), (453, 1), (455, 1), (457, 1), (458, 1), (459, 1), (460, 1), (461, 1), (462, 1), (465, 1), (466, 1), (467, 1), (468, 1), (469, 1), (470, 1), (471, 1), (474, 1), (475, 1), (476, 1), (479, 1), (481, 1), (488, 1), (490, 1), (491, 1), (492, 1), (496, 1), (497, 1), (498, 1), (499, 1), (500, 1), (501, 1), (502, 1), (503, 1), (504, 1), (505, 1), (506, 1), (507, 1), (509, 1), (510, 1), (511, 1), (514, 1), (515, 1), (517, 1), (520, 1), (521, 1), (525, 1), (526, 1), (530, 1), (532, 1), (533, 1), (536, 1), (537, 1), (538, 1), (540, 1), (542, 1), (543, 1), (544, 1), (545, 1), (546, 1), (547, 1), (548, 1), (550, 1), (552, 1), (553, 1), (555, 1), (556, 1), (557, 1), (558, 1), (559, 1), (560, 1), (562, 1), (564, 1), (566, 1), (568, 1), (572, 1), (573, 1), (575, 1), (576, 1), (578, 1), (579, 1), (581, 1), (582, 1), (584, 1), (587, 1), (588, 1), (589, 1), (590, 1), (592, 1), (593, 1), (595, 1), (596, 1), (597, 1), (598, 1), (599, 1), (600, 1), (604, 1), (607, 1), (612, 1), (613, 1), (615, 1), (616, 1), (618, 1), (620, 1), (621, 1), (622, 1), (624, 1), (625, 1), (626, 1), (627, 1), (628, 1), (631, 1), (632, 1), (633, 1), (634, 1), (635, 1), (637, 1), (638, 1), (639, 1), (640, 1), (641, 1), (642, 1), (644, 1), (645, 1), (646, 1), (647, 1), (649, 1), (650, 1), (653, 1), (655, 1), (656, 1), (657, 1), (658, 1), (660, 1), (661, 1), (663, 1), (664, 1), (665, 1), (666, 1), (667, 1), (668, 1), (669, 1), (671, 1), (672, 1), (673, 1), (675, 1), (677, 1), (678, 1), (680, 1), (682, 1), (684, 1), (685, 1), (686, 1), (687, 1), (688, 1), (689, 1), (690, 1), (694, 1), (695, 1), (696, 1), (698, 1), (699, 1), (700, 1), (702, 1), (703, 1), (705, 1), (706, 1), (707, 1), (709, 1), (710, 1), (711, 1), (712, 1), (714, 1), (717, 1), (718, 1), (721, 1), (722, 1), (723, 1), (724, 1), (725, 1), (726, 1), (727, 1), (728, 1), (730, 1), (732, 1), (733, 1), (734, 1), (736, 1), (737, 1), (738, 1), (739, 1), (740, 1), (741, 1), (742, 1), (743, 1), (748, 1), (749, 1), (750, 1), (751, 1), (752, 1), (753, 1), (754, 1), (757, 1), (759, 1), (760, 1), (761, 1), (762, 1), (765, 1), (766, 1), (767, 1), (768, 1), (770, 1), (772, 1), (774, 1), (775, 1), (777, 1), (778, 1), (779, 1), (782, 1), (783, 1), (785, 1), (786, 1), (788, 1), (789, 1), (791, 1), (795, 1), (796, 1), (798, 1), (800, 1), (801, 1), (805, 1), (806, 1), (807, 1), (808, 1), (809, 1), (814, 1), (816, 1), (819, 1), (820, 1), (821, 1), (822, 1), (823, 1), (824, 1), (827, 1), (828, 1), (829, 1), (830, 1), (831, 1), (833, 1), (834, 1), (837, 1), (838, 1), (839, 1), (841, 1), (843, 1), (844, 1), (845, 1), (846, 1), (847, 1), (848, 1), (849, 1), (853, 1), (854, 1), (856, 1), (857, 1), (858, 1), (860, 1), (861, 1), (863, 1), (864, 1), (865, 1), (866, 1), (868, 1), (869, 1), (870, 1), (871, 1), (872, 1), (873, 1), (878, 1), (879, 1), (880, 1), (881, 1), (882, 1), (884, 1), (886, 1), (887, 1), (890, 1), (891, 1), (894, 1), (895, 1), (899, 1), (900, 1), (901, 1), (905, 1), (909, 1), (910, 1), (912, 1), (914, 1), (915, 1), (916, 1), (917, 1), (918, 1), (919, 1), (920, 1), (921, 1), (922, 1), (925, 1), (926, 1), (928, 1), (929, 1), (930, 1), (931, 1), (932, 1), (934, 1), (935, 1), (936, 1), (937, 1), (938, 1), (940, 1), (941, 1), (943, 1), (944, 1), (945, 1), (946, 1), (947, 1), (948, 1), (949, 1), (950, 1), (952, 1), (953, 1), (955, 1), (957, 1), (959, 1), (961, 1), (965, 1), (967, 1), (968, 1), (970, 1), (971, 1), (972, 1), (976, 1), (977, 1), (978, 1), (979, 1), (981, 1), (984, 1), (985, 1), (986, 1), (995, 1), (996, 1), (997, 1), (998, 1), (999, 1), (1000, 1), (1001, 1), (1002, 1), (1004, 1), (1005, 1), (1007, 1), (1009, 1), (1010, 1), (1011, 1), (1013, 1), (1014, 1), (1015, 1), (1016, 1), (1018, 1), (1019, 1), (1021, 1), (1023, 1), (1024, 1), (1025, 1), (1026, 1), (1029, 1), (1030, 1), (1031, 1), (1032, 1), (1033, 1), (1034, 1), (1035, 1), (1037, 1), (1038, 1), (1039, 1), (1040, 1), (1041, 1), (1043, 1), (1045, 1), (1046, 1), (1047, 1), (1048, 1), (1049, 1), (1051, 1), (1053, 1), (1054, 1), (1055, 1), (1056, 1), (1058, 1), (1060, 1), (1062, 1), (1064, 1), (1067, 1), (1072, 1), (1075, 1), (1076, 1), (1079, 1), (1083, 1), (1084, 1), (1085, 1), (1088, 1), (1090, 1), (1091, 1), (1092, 1), (1093, 1), (1094, 1), (1095, 1), (1096, 1), (1099, 1), (1100, 1), (1102, 1), (1104, 1), (1105, 1), (1106, 1), (1111, 1), (1112, 1), (1113, 1), (1118, 1), (1120, 1), (1121, 1), (1122, 1), (1123, 1), (1124, 1), (1126, 1), (1127, 1), (1129, 1), (1130, 1), (1132, 1), (1133, 1), (1134, 1), (1135, 1), (1138, 1), (1139, 1), (1140, 1), (1141, 1), (1143, 1), (1144, 1), (1145, 1), (1146, 1), (1147, 1), (1149, 1), (1153, 1), (1154, 1), (1156, 1), (1157, 1), (1158, 1), (1159, 1), (1160, 1), (1161, 1), (1162, 1), (1164, 1), (1165, 1), (1167, 1), (1168, 1), (1169, 1), (1172, 1), (1174, 1), (1178, 1), (1181, 1), (1183, 1), (1184, 1), (1186, 1), (1189, 1), (1193, 1), (1196, 1), (1197, 1), (1198, 1), (1199, 1), (1200, 1), (1202, 1), (1205, 1), (1208, 1), (1209, 1), (1211, 1), (1213, 1), (1215, 1), (1216, 1), (1217, 1), (1218, 1), (1220, 1), (1221, 1), (1222, 1), (1223, 1), (1224, 1), (1225, 1), (1226, 1), (1227, 1), (1229, 1), (1230, 1), (1231, 1), (1232, 1), (1233, 1), (1234, 1), (1236, 1), (1238, 1), (1239, 1), (1240, 1), (1242, 1), (1245, 1), (1246, 1), (1247, 1), (1249, 1), (1252, 1), (1257, 1), (1258, 1), (1259, 1), (1260, 1), (1261, 1), (1262, 1), (1263, 1), (1264, 1), (1265, 1), (1266, 1), (1268, 1), (1270, 1), (1271, 1), (1274, 1), (1275, 1), (1277, 1), (1278, 1), (1279, 1), (1280, 1), (1281, 1), (1284, 1), (1285, 1), (1288, 1), (1289, 1), (1292, 1), (1293, 1), (1294, 1), (1295, 1), (1296, 1), (1297, 1), (1298, 1), (1299, 1), (1302, 1), (1304, 1), (1306, 1), (1307, 1), (1309, 1), (1310, 1), (1311, 1), (1312, 1), (1314, 1), (1315, 1), (1318, 1), (1320, 1), (1321, 1), (1322, 1), (1323, 1), (1324, 1), (1326, 1), (1327, 1), (1330, 1), (1334, 1), (1336, 1), (1338, 1), (1339, 1), (1342, 1), (1343, 1), (1344, 1), (1346, 1), (1347, 1), (1348, 1), (1349, 1), (1351, 1), (1353, 1), (1354, 1), (1355, 1), (1356, 1), (1357, 1), (1359, 1), (1360, 1), (1362, 1), (1364, 1), (1365, 1), (1367, 1), (1368, 1), (1369, 1), (1370, 1), (1371, 1), (1372, 1), (1374, 1), (1375, 1), (1376, 1), (1377, 1), (1378, 1), (1379, 1), (1382, 1), (1383, 1), (1384, 1), (1386, 1), (1387, 1), (1389, 1), (1390, 1), (1391, 1), (1392, 1), (1393, 1), (1395, 1), (1396, 1), (1397, 1), (1398, 1), (1401, 1), (1402, 1), (1405, 1), (1406, 1), (1407, 1), (1408, 1), (1410, 1), (1412, 1), (1414, 1), (1415, 1), (1418, 1), (1420, 1), (1421, 1), (1422, 1), (1424, 1), (1426, 1), (1430, 1), (1431, 1), (1433, 1), (1436, 1), (1437, 1), (1438, 1), (1441, 1), (1445, 1), (1448, 1), (1450, 1), (1452, 1), (1454, 1), (1455, 1), (1457, 1), (1458, 1), (1459, 1), (1460, 1), (1461, 1), (1462, 1), (1463, 1), (1464, 1), (1466, 1), (1467, 1), (1468, 1), (1470, 1), (1471, 1), (1476, 1), (1479, 1), (1480, 1), (1482, 1), (1483, 1), (1484, 1), (1485, 1), (1486, 1), (1488, 1), (1490, 1), (1491, 1), (1492, 1), (1493, 1), (1494, 1), (1499, 1), (1502, 1), (1505, 1), (1506, 1), (1507, 1), (1509, 1), (1511, 1), (1512, 1), (1517, 1), (1521, 1), (1522, 1), (1523, 1), (1526, 1), (1532, 1), (1533, 1), (1535, 1), (1537, 1), (1539, 1), (1540, 1), (1541, 1), (1547, 1), (1548, 1), (1551, 1), (1555, 1), (1556, 1), (1557, 1), (1559, 1), (1561, 1), (1562, 1), (1565, 1), (1567, 1), (1568, 1), (1569, 1), (1570, 1), (1571, 1), (1572, 1), (1573, 1), (1574, 1), (1575, 1), (1578, 1), (1579, 1), (1580, 1), (1587, 1), (1588, 1), (1593, 1), (1594, 1), (1596, 1), (1598, 1), (1599, 1), (1601, 1), (1604, 1), (1605, 1), (1606, 1), (1608, 1), (1609, 1), (1610, 1), (1614, 1), (1617, 1), (1618, 1), (1622, 1), (1623, 1), (1626, 1), (1627, 1), (1631, 1), (1632, 1), (1633, 1), (1635, 1), (1636, 1), (1637, 1), (1638, 1), (1639, 1), (1641, 1), (1642, 1), (1644, 1), (1646, 1), (1651, 1), (1653, 1), (1656, 1), (1658, 1), (1659, 1), (1662, 1), (1665, 1), (1668, 1), (1669, 1), (1673, 1), (1674, 1), (1675, 1), (1676, 1), (1678, 1), (1679, 1), (1681, 1), (1682, 1), (1683, 1), (1684, 1), (1687, 1), (1688, 1), (1689, 1), (1690, 1), (1691, 1), (1695, 1), (1696, 1), (1697, 1), (1698, 1), (1699, 1), (1701, 1), (1704, 1), (1705, 1), (1710, 1), (1714, 1), (1716, 1), (1718, 1), (1721, 1), (1722, 1), (1723, 1), (1726, 1), (1732, 1), (1734, 1), (1735, 1), (1737, 1), (1739, 1), (1741, 1), (1742, 1), (1745, 1), (1746, 1), (1747, 1), (1748, 1), (1749, 1), (1752, 1), (1753, 1), (1756, 1), (1757, 1), (1759, 1), (1762, 1), (1763, 1), (1765, 1), (1766, 1), (1767, 1), (1769, 1), (1773, 1), (1774, 1), (1775, 1), (1776, 1), (1777, 1), (1780, 1), (1782, 1), (1784, 1), (1787, 1), (1790, 1), (1792, 1), (1793, 1), (1794, 1), (1800, 1), (1801, 1), (1804, 1), (1805, 1), (1809, 1), (1810, 1), (1811, 1), (1812, 1), (1817, 1), (1819, 1), (1820, 1), (1821, 1), (1822, 1), (1823, 1), (1824, 1), (1826, 1), (1827, 1), (1831, 1), (1832, 1), (1833, 1), (1835, 1), (1839, 1), (1841, 1), (1842, 1), (1845, 1), (1848, 1), (1850, 1), (1855, 1), (1856, 1), (1857, 1), (1859, 1), (1860, 1), (1863, 1), (1864, 1), (1866, 1), (1868, 1), (1872, 1), (1873, 1), (1874, 1), (1881, 1), (1882, 1), (1883, 1), (1884, 1), (1885, 1), (1887, 1), (1889, 1), (1892, 1), (1893, 1), (1894, 1), (1895, 1), (1896, 1), (1898, 1), (1903, 1), (1906, 1), (1908, 1), (1912, 1), (1913, 1), (1914, 1), (1915, 1), (1919, 1), (1920, 1), (1923, 1), (1925, 1), (1926, 1), (1927, 1), (1928, 1), (1929, 1), (1930, 1), (1932, 1), (1933, 1), (1936, 1), (1937, 1), (1938, 1), (1939, 1), (1941, 1), (1942, 1), (1944, 1), (1946, 1), (1948, 1), (1949, 1), (1952, 1), (1953, 1), (1957, 1), (1959, 1), (1960, 1), (1961, 1), (1962, 1), (1964, 1), (1968, 1), (1969, 1), (1970, 1), (1971, 1), (1972, 1), (1974, 1), (1975, 1), (1977, 1), (1979, 1), (1984, 1), (1986, 1), (1987, 1), (1988, 1), (1989, 1), (1992, 1), (1993, 1), (1994, 1), (1995, 1), (1998, 1), (1999, 1), (2002, 1), (2003, 1), (2006, 1), (2007, 1), (2008, 1), (2011, 1), (2012, 1), (2013, 1), (2015, 1), (2016, 1), (2017, 1), (2018, 1), (2021, 1), (2026, 1), (2030, 1), (2032, 1), (2037, 1), (2039, 1), (2040, 1), (2041, 1), (2044, 1), (2045, 1), (2047, 1), (2049, 1), (2053, 1), (2055, 1), (2056, 1), (2057, 1), (2061, 1), (2062, 1), (2063, 1), (2064, 1), (2065, 1), (2066, 1), (2070, 1), (2071, 1), (2072, 1), (2073, 1), (2074, 1), (2075, 1), (2076, 1), (2078, 1), (2079, 1), (2081, 1), (2085, 1), (2086, 1), (2089, 1), (2090, 1), (2091, 1), (2095, 1), (2097, 1), (2098, 1), (2100, 1), (2104, 1), (2105, 1), (2106, 1), (2107, 1), (2108, 1), (2109, 1), (2111, 1), (2113, 1), (2115, 1), (2116, 1), (2117, 1), (2121, 1), (2125, 1), (2127, 1), (2137, 1), (2138, 1), (2139, 1), (2142, 1), (2144, 1), (2145, 1), (2148, 1), (2151, 1), (2154, 1), (2156, 1), (2161, 1), (2162, 1), (2165, 1), (2173, 1), (2174, 1), (2180, 1), (2181, 1), (2182, 1), (2183, 1), (2185, 1), (2186, 1), (2187, 1), (2191, 1), (2193, 1), (2194, 1), (2197, 1), (2198, 1), (2201, 1), (2204, 1), (2206, 1), (2210, 1), (2212, 1), (2213, 1), (2217, 1), (2218, 1), (2220, 1), (2227, 1), (2229, 1), (2230, 1), (2233, 1), (2235, 1), (2236, 1), (2238, 1), (2241, 1), (2244, 1), (2246, 1), (2253, 1), (2254, 1), (2255, 1), (2261, 1), (2265, 1), (2266, 1), (2267, 1), (2268, 1), (2269, 1), (2272, 1), (2277, 1), (2278, 1), (2280, 1), (2281, 1), (2282, 1), (2283, 1), (2292, 1), (2293, 1), (2300, 1), (2303, 1), (2304, 1), (2307, 1), (2308, 1), (2309, 1), (2310, 1), (2312, 1), (2314, 1), (2316, 1), (2318, 1), (2324, 1), (2325, 1), (2327, 1), (2328, 1), (2333, 1), (2335, 1), (2336, 1), (2340, 1), (2342, 1), (2344, 1), (2346, 1), (2353, 1), (2361, 1), (2364, 1), (2371, 1), (2373, 1), (2375, 1), (2378, 1), (2379, 1), (2380, 1), (2381, 1), (2383, 1), (2385, 1), (2386, 1), (2391, 1), (2392, 1), (2394, 1), (2397, 1), (2399, 1), (2401, 1), (2402, 1), (2404, 1), (2407, 1), (2410, 1), (2411, 1), (2415, 1), (2419, 1), (2423, 1), (2429, 1), (2437, 1), (2438, 1), (2440, 1), (2444, 1), (2446, 1), (2450, 1), (2451, 1), (2452, 1), (2455, 1), (2461, 1), (2463, 1), (2464, 1), (2465, 1), (2467, 1), (2468, 1), (2469, 1), (2472, 1), (2474, 1), (2479, 1), (2480, 1), (2485, 1), (2486, 1), (2487, 1), (2489, 1), (2490, 1), (2496, 1), (2497, 1), (2051, 1), (2052, 1), (2134, 1), (2234, 1), (2259, 1), (2400, 1), (2408, 1), (2495, 1), (2140, 1), (2249, 1), (2311, 1), (127, 1), (228, 1), (232, 1), (314, 1), (405, 1), (439, 1), (483, 1), (489, 1), (493, 1), (508, 1), (523, 1), (549, 1), (551, 1), (571, 1), (603, 1), (606, 1), (609, 1), (630, 1), (643, 1), (652, 1), (674, 1), (697, 1), (716, 1), (720, 1), (729, 1), (731, 1), (756, 1), (784, 1), (790, 1), (811, 1), (826, 1), (836, 1), (842, 1), (876, 1), (883, 1), (897, 1), (908, 1), (924, 1), (927, 1), (958, 1), (963, 1), (974, 1), (980, 1), (1020, 1), (1028, 1), (1050, 1), (1057, 1), (1061, 1), (1081, 1), (1097, 1), (1108, 1), (1110, 1), (1116, 1), (1125, 1), (1136, 1), (1142, 1), (1152, 1), (1163, 1), (1171, 1), (1179, 1), (1190, 1), (1192, 1), (1195, 1), (1203, 1), (1204, 1), (1228, 1), (1243, 1), (1244, 1), (1251, 1), (1253, 1), (1283, 1), (1300, 1), (1305, 1), (1317, 1), (1335, 1), (1358, 1), (1381, 1), (1385, 1), (1417, 1), (1419, 1), (1425, 1), (1427, 1), (1432, 1), (1442, 1), (1444, 1), (1446, 1), (1447, 1), (1449, 1), (1456, 1), (1474, 1), (1475, 1), (1477, 1), (1478, 1), (1495, 1), (1498, 1), (1500, 1), (1515, 1), (1519, 1), (1534, 1), (1536, 1), (1543, 1), (1550, 1), (1554, 1), (1560, 1), (1566, 1), (1576, 1), (1584, 1), (1585, 1), (1589, 1), (1597, 1), (1602, 1), (1607, 1), (1612, 1), (1619, 1), (1624, 1), (1629, 1), (1650, 1), (1652, 1), (1666, 1), (1667, 1), (1670, 1), (1694, 1), (1711, 1), (1715, 1), (1717, 1), (1719, 1), (1724, 1), (1743, 1), (1755, 1), (1768, 1), (1783, 1), (1795, 1), (1797, 1), (1807, 1), (1815, 1), (1818, 1), (1825, 1), (1829, 1), (1830, 1), (1837, 1), (1847, 1), (1862, 1), (1870, 1), (1875, 1), (1878, 1), (1890, 1), (1891, 1), (1902, 1), (1904, 1), (1905, 1), (1924, 1), (1931, 1), (1935, 1), (1943, 1), (1954, 1), (1955, 1), (1956, 1), (1965, 1), (1967, 1), (1982, 1), (1996, 1), (2001, 1), (2010, 1), (2022, 1), (2029, 1), (2042, 1), (2083, 1), (2094, 1), (2101, 1), (2110, 1), (2114, 1), (2131, 1), (2135, 1), (2136, 1), (2141, 1), (2146, 1), (2150, 1), (2167, 1), (2168, 1), (2170, 1), (2171, 1), (2172, 1), (2179, 1), (2184, 1), (2189, 1), (2205, 1), (2207, 1), (2208, 1), (2216, 1), (2221, 1), (2223, 1), (2225, 1), (2226, 1), (2231, 1), (2237, 1), (2243, 1), (2248, 1), (2250, 1), (2258, 1), (2264, 1), (2273, 1), (2275, 1), (2276, 1), (2284, 1), (2285, 1), (2288, 1), (2289, 1), (2291, 1), (2305, 1), (2330, 1), (2331, 1), (2332, 1), (2339, 1), (2341, 1), (2351, 1), (2355, 1), (2358, 1), (2363, 1), (2366, 1), (2372, 1), (2390, 1), (2409, 1), (2421, 1), (2433, 1), (2448, 1), (2456, 1), (2462, 1), (2470, 1), (2482, 1), (2492, 1), (2068, 1), (2211, 1), (877, 1), (1552, 1), (1611, 1), (1645, 1), (1785, 1), (196, 1), (284, 1), (372, 1), (780, 1), (781, 1), (875, 1), (898, 1), (939, 1), (966, 1), (988, 1), (993, 1), (1008, 1), (1027, 1), (1101, 1), (1117, 1), (1255, 1), (1256, 1), (1331, 1), (1340, 1), (1428, 1), (1440, 1), (1451, 1), (1472, 1), (1503, 1), (1510, 1), (1582, 1), (1600, 1), (1620, 1), (1621, 1), (1625, 1), (1648, 1), (1649, 1), (1663, 1), (1664, 1), (1703, 1), (1707, 1), (1709, 1), (1713, 1), (1786, 1), (1849, 1), (1851, 1), (1853, 1), (1858, 1), (1867, 1), (1900, 1), (1907, 1), (1910, 1), (1916, 1), (1978, 1), (1981, 1), (1991, 1), (2000, 1), (2005, 1), (2028, 1), (2031, 1), (2060, 1), (2080, 1), (2092, 1), (2102, 1), (2130, 1), (2132, 1), (2143, 1), (2163, 1), (2242, 1), (2274, 1), (2297, 1), (2302, 1), (2323, 1), (904, 1), (1531, 1), (154, 1), (1764, 1), (311, 1), (418, 1), (434, 1), (486, 1), (840, 1), (885, 1), (969, 1), (1006, 1), (1103, 1), (1514, 1), (1530, 1), (1591, 1), (1754, 1), (1808, 1), (1869, 1), (1934, 1), (1940, 1), (2034, 1), (406, 1), (463, 1), (693, 1), (744, 1), (746, 1), (874, 1), (893, 1), (1071, 1), (1267, 1), (1328, 1), (1409, 1), (1524, 1), (1798, 1), (1865, 1), (1963, 1), (745, 1), (608, 1), (1098, 1), (1496, 1), (1544, 1), (1661, 1), (1729, 1), (1738, 1), (1909, 1), (2046, 1), (168, 1), (1063, 1), (1254, 1), (1513, 1), (2020, 1), (942, 1), (1950, 1), (735, 1), (1332, 1), (676, 1), (1770, 1), (2343, 1), (2377, 1), (2382, 1), (2387, 1), (2403, 1), (2412, 1), (2416, 1), (2420, 1), (2422, 1), (2460, 1), (2466, 1), (2478, 1), (2494, 1), (2099, 1), (2112, 1), (2124, 1), (2128, 1), (2133, 1), (2160, 1), (2219, 1), (2251, 1), (2296, 1), (2319, 1), (2322, 1), (2360, 1), (2425, 1), (2439, 1), (2441, 1), (2442, 1), (2454, 1), (2473, 1), (2058, 1), (2077, 1), (2120, 1), (2178, 1), (2203, 1), (2262, 1), (2347, 1), (2362, 1), (2406, 1), (2428, 1), (2434, 1), (2445, 1), (2084, 1), (2088, 1), (2294, 1), (2306, 1), (2352, 1), (2395, 1), (2199, 1), (2200, 1), (2430, 1), (2158, 1), (2315, 1), (2118, 1), (2384, 1), (2195, 1), (2224, 1), (2417, 1), (2369, 1), (2376, 1), (2313, 1), (2354, 1), (2443, 1), (2356, 1), (2432, 1)]\n"
     ]
    }
   ],
   "source": [
    "print(con.fetchall())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "63f55a93",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<duckdb.DuckDBPyConnection at 0x7fbb9bd435b0>"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "con.execute(\"SELECT *  FROM ontime where communityId=3421\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "9ea328e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[(7, 7, 3421, None), (32, 32, 3421, None), (38, 38, 3421, None), (44, 44, 3421, None), (132, 132, 3421, None), (167, 167, 3421, None), (193, 193, 3421, None), (230, 230, 3421, None), (351, 351, 3421, None), (381, 381, 3421, None), (402, 402, 3421, None), (529, 529, 3421, None), (610, 610, 3421, None), (951, 951, 3421, None), (962, 962, 3421, None), (973, 973, 3421, None), (1022, 1022, 3421, None), (1036, 1036, 3421, None), (1065, 1065, 3421, None), (1078, 1078, 3421, None), (1086, 1086, 3421, None), (1107, 1107, 3421, None), (1151, 1151, 3421, None), (1176, 1176, 3421, None), (1210, 1210, 3421, None), (1219, 1219, 3421, None), (1235, 1235, 3421, None), (1248, 1248, 3421, None), (1345, 1345, 3421, None), (1404, 1404, 3421, None), (1702, 1702, 3421, None), (1712, 1712, 3421, None), (1778, 1778, 3421, None), (2222, 2222, 3421, None), (2240, 2240, 3421, None), (2252, 2252, 3421, None), (2257, 2257, 3421, None), (2263, 2263, 3421, None), (2337, 2337, 3421, None), (2359, 2359, 3421, None), (2365, 2365, 3421, None), (2368, 2368, 3421, None), (2389, 2389, 3421, None), (2393, 2393, 3421, None), (2396, 2396, 3421, None), (2471, 2471, 3421, None), (2476, 2476, 3421, None), (2498, 2498, 3421, None), (2499, 2499, 3421, None), (2500, 2500, 3421, None), (2501, 2501, 3421, None), (2515, 2515, 3421, None), (2516, 2516, 3421, None), (2517, 2517, 3421, None), (2519, 2519, 3421, None), (2521, 2521, 3421, None), (2522, 2522, 3421, None), (2523, 2523, 3421, None), (2524, 2524, 3421, None), (2525, 2525, 3421, None), (2526, 2526, 3421, None), (2528, 2528, 3421, None), (2529, 2529, 3421, None), (2530, 2530, 3421, None), (2531, 2531, 3421, None), (2532, 2532, 3421, None), (2533, 2533, 3421, None), (2534, 2534, 3421, None), (2535, 2535, 3421, None), (2536, 2536, 3421, None), (2537, 2537, 3421, None), (2538, 2538, 3421, None), (2539, 2539, 3421, None), (2540, 2540, 3421, None), (2541, 2541, 3421, None), (2542, 2542, 3421, None), (2543, 2543, 3421, None), (2544, 2544, 3421, None), (2545, 2545, 3421, None), (2546, 2546, 3421, None), (2547, 2547, 3421, None), (2549, 2549, 3421, None), (2550, 2550, 3421, None), (2551, 2551, 3421, None), (2552, 2552, 3421, None), (2553, 2553, 3421, None), (2554, 2554, 3421, None), (2556, 2556, 3421, None), (2557, 2557, 3421, None), (2558, 2558, 3421, None), (2559, 2559, 3421, None), (2560, 2560, 3421, None), (2561, 2561, 3421, None), (2562, 2562, 3421, None), (2563, 2563, 3421, None), (2564, 2564, 3421, None), (2565, 2565, 3421, None), (2566, 2566, 3421, None), (2567, 2567, 3421, None), (2568, 2568, 3421, None), (2569, 2569, 3421, None), (2571, 2571, 3421, None), (2572, 2572, 3421, None), (2575, 2575, 3421, None), (2577, 2577, 3421, None), (2578, 2578, 3421, None), (2613, 2613, 3421, None), (2634, 2634, 3421, None), (2635, 2635, 3421, None), (2636, 2636, 3421, None), (2637, 2637, 3421, None), (2650, 2650, 3421, None), (2651, 2651, 3421, None), (2781, 2781, 3421, None), (2821, 2821, 3421, None), (2822, 2822, 3421, None), (2823, 2823, 3421, None), (2824, 2824, 3421, None), (3058, 3058, 3421, None), (3059, 3059, 3421, None), (3177, 3177, 3421, None), (3178, 3178, 3421, None), (3179, 3179, 3421, None), (3180, 3180, 3421, None), (3181, 3181, 3421, None), (3189, 3189, 3421, None), (3201, 3201, 3421, None), (3237, 3237, 3421, None), (3238, 3238, 3421, None), (3246, 3246, 3421, None), (3247, 3247, 3421, None), (3267, 3267, 3421, None), (3268, 3268, 3421, None), (3269, 3269, 3421, None), (3270, 3270, 3421, None), (3271, 3271, 3421, None), (3299, 3299, 3421, None), (3300, 3300, 3421, None), (3301, 3301, 3421, None), (3302, 3302, 3421, None), (3303, 3303, 3421, None), (3324, 3324, 3421, None), (3328, 3328, 3421, None), (3329, 3329, 3421, None), (3330, 3330, 3421, None), (3331, 3331, 3421, None), (3332, 3332, 3421, None), (3333, 3333, 3421, None), (3334, 3334, 3421, None), (3335, 3335, 3421, None), (3336, 3336, 3421, None), (3337, 3337, 3421, None), (3338, 3338, 3421, None), (3339, 3339, 3421, None), (3340, 3340, 3421, None), (3341, 3341, 3421, None), (3342, 3342, 3421, None), (3343, 3343, 3421, None), (3344, 3344, 3421, None), (3345, 3345, 3421, None), (3403, 3403, 3421, None), (3421, 3421, 3421, None), (3422, 3422, 3421, None), (3540, 3540, 3421, None), (3545, 3545, 3421, None), (3696, 3696, 3421, None), (3697, 3697, 3421, None), (3698, 3698, 3421, None), (3699, 3699, 3421, None), (3700, 3700, 3421, None), (3704, 3704, 3421, None), (3705, 3705, 3421, None), (3706, 3706, 3421, None), (3707, 3707, 3421, None), (3708, 3708, 3421, None), (3709, 3709, 3421, None), (3710, 3710, 3421, None), (3735, 3735, 3421, None), (3736, 3736, 3421, None), (3740, 3740, 3421, None), (3741, 3741, 3421, None), (3858, 3858, 3421, None), (3859, 3859, 3421, None), (3860, 3860, 3421, None), (3861, 3861, 3421, None), (3862, 3862, 3421, None), (3993, 3993, 3421, None), (3994, 3994, 3421, None), (3999, 3999, 3421, None), (4156, 4156, 3421, None)]\n"
     ]
    }
   ],
   "source": [
    "print(con.fetchall())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "5ab245a8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import nxneo4j as nxgraphdatascience"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2107495a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo4j",
   "language": "python",
   "name": "neo4j"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
